<?php
//======================================================================================
spl_autoload_register(function ($name) {
    include './src/' . $name .'.php';
});
//======================================================================================
$pagetitle='Создание классов - урок 10'; // заголовок для страницы
//======================================================================================

function mes (string $msg, $color='blue', $bcolor='' ) //вывод на сайт сообщений, когда что-то пошло не так
    {
        if($bcolor!=''){$bcolor='-'.$bcolor;}
        printf("<div class='sub%s msg m-%s'><p>%s</p></div>",$bcolor,$color,$msg);
    }


require_once './page_parts/header.php'; // подгружаем стаичный заголовок сайта